package main

import "fmt"

// Покажчик визначає адресу памʼяті за якою знаходиться значення.
// Тип покажчика позначається зірочкою біля типу значення *int.
// Не існує окремого типу покажчик, для кожного типу значення є відповідний тип покажчик.
//  int -> *int
//  string -> *string

func main() {
	var a = 1 // int
	var p *int

	// & - оператор посилання на тип, повертає адресу за якою знаходиться значення.
	p = &a

	fmt.Printf("a type: %T, pointer: %p, value: %v\n", a, &a, a)
	fmt.Printf("p type: %T, pointer: %p, value: %v\n", p, &p, p)

	// Оператор * повертає значення, що знаходиться за даним покажчиком.
	// Не плутайте зі знаком * біля типу.
	c := *p

	fmt.Printf("c type %T, pointer: %p, value: %v\n", c, &c, c)
}
