package main

import (
	"fmt"
)

func main() {
	// Визначення мапи з нульовим значенням
	var m1 map[string]int
	// Визначення порожньої мапи
	m2 := map[[1]int]func() error{}
	// Визначення порожньої мапи з визначеною довжиною.
	// Довжина дозволяє виділити достатню кількість памʼяті, щоб уникнути зайвого копіювання даних.
	m3 := make(map[string]string, 1024)

	// Мапа з нульовим значенням та порожня мапа працюють так само як і зріз
	fmt.Println(m1 == nil)
	fmt.Println(m2 == nil)
	fmt.Println(m3 == nil)
}
