package main

import (
	"fmt"
)

func main() {
	var a [3]int                 // Ініціалізація порожнього масиву розміром 3.
	b := [4]int{2}               // Ініціалізація масиву розміром 4, з заданими значеннями, масив доповнюється нулями.
	c := [4]int{1: -2, 3: 2}     // Ініціалізація масиву розміром 4, з заданими значеннями по індексу.
	d := [...]int{2, 3, 4, 9: 1} // Ініціалізація масиву з розміром на основі кількості заданих елементів

	b[2] = 10 // визначення певного елементу

	fmt.Println(a)
	fmt.Println(b)
	fmt.Println(c)
	fmt.Println(d)
}
