package main

import "fmt"

// Визначення змінних можна обʼєднувати в блоки
var (
	n1 int
	n2 bool
	n3 string
)

// Можна об'єднувати визначення змінних з однаковим типом
var s1, s2 string

// Можна об'єднувати визначення змінних з ініціалізацією.
var b1, s3 = true, "false"

func main() {
	var a int      // Визначення змінної з нулевим значенням.
	var b = 1      // Визначення змінної з початковим значенням, в такому випадку тим буде int/float64.
	var c int8 = 1 // Визначення змінної з початковим значенням, якщо нам потрібен тип відмінний від базового.
	d := 3.1       // Спрощене визначення змінної, рекомендований варіант, якщо значення відоме.
	// d := float32(3.1) // Спрощене визначення з явним вказанням типу.

	fmt.Printf("%T %v\n", a, a)
	fmt.Printf("%T %v\n", b, b)
	fmt.Printf("%T %v\n", c, c)
	fmt.Printf("%T %v\n", d, d)
}

// Змінні визначені у функції обов'язково мають використовуватись, інакше компілятор видасть помилку
// Змінні визначені у пакеті, компілятор дозволяє не використовувати, але можна налаштувати linter для перевірки.
