package main

import "fmt"

// При передачі у функцію всі значення копіюються.
// При передачі значення копіюється значення і робота буде вестись з копією
// При передачі покажчика, копіюється адреса, тоді як значення залишаєтсья одне.
// Відповідно в такому випадку робота буде вестись над початковим значенням.

// minus змінює знак числа на протилежний
func minus(i int) {
	i = -1 * i
	fmt.Printf("minus: %v, %p\n", i, &i)
}

// minus змінює знак числа на протилежний
func minus2(i *int) {
	*i = -1 * *i
	fmt.Printf("minus2: %v, %p\n", *i, i)
}

func main() {
	var a = 10

	fmt.Printf("main: %v, %p\n", a, &a)
	fmt.Println("--------------")

	// Значення 'а' копіюється
	minus(a)

	fmt.Printf("main: %v, %p\n", a, &a)
	fmt.Println("--------------")

	// Адреса а копіюється
	minus2(&a)

	fmt.Printf("main: %v, %p\n", a, &a)
}
