package main

import "fmt"

var a = 1
var b float32 = 2
var c = 2.2

func main() {
	var a int // створюється нова змінна, в області функції main
	b := 1    // створюється нова змінна, в області функції main
	c = 3     // оновлюється глобальна змінна

	// В Go область бачення змінних визначається блоком, тобто фігурними лапками.
	// В кожному новому блоці можна перевизначати змінні, що є у верхньому блоці.
	if b > a {
		c := "test" // нова змінна
		fmt.Println(c)
	}

	fmt.Printf("%T %v\n", a, a)
	fmt.Printf("%T %v\n", b, b)
	fmt.Printf("%T %v\n", c, c)
}
